from hoshino import HoshinoBot  # noqa

from ..path_and_json import *  # noqa

base_svt_detail = {
    "画师": "",
    "声优": "",
    "职阶": "",
    "性别（用于战斗和任务时的数据）": "",
    "身高": "",
    "体重": "",
    "属性": "",
    "隐藏属性": "",
    "筋力": "",
    "耐久": "",
    "敏捷": "",
    "魔力": "",
    "幸运": "",
    "宝具资料面板中列出的参数": "",
    "能力": [
        "基础",
        "满级",
        "90级",
        "100级",
        "120级"
    ],
    "ATK": [
        "",
        "",
        "",
        "",
        ""
    ],
    "职阶补正后": [
        "",
        "",
        "",
        "",
        ""
    ],
    "HP": [
        "",
        "",
        "",
        "",
        ""
    ],
    "Hit信息（括号内为每hit伤害百分比）": "",
    "Quick": "",
    "Arts": "",
    "Buster": "",
    "Extra": "",
    "宝具": "",
    "NP获得率": {
        "Quick": "",
        "Arts": "",
        "Buster": "",
        "Extra": "",
        "宝具": ""
    },
    "受击": "",
    "出星率": "",
    "被即死率": "",
    "暴击星分配权重": "",
    "特性": "",
    "人型": "",
    "被EA特攻": "",
    "猪化状态": ""
}

sp_svt_detail = {
    "画师": "",
    "声优": "",
    "职阶": "",
    "性别": "",
    "身高": "",
    "体重": "",
    "属性": "",
    "隐藏属性": "",
    "筋力": "",
    "耐久": "",
    "敏捷": "",
    "魔力": "",
    "幸运": "",
    "宝具": "",
    "特性": "",
    "人型": ""
}

cmd_detail = {
    "画师": "",
    "持有技能": "",
    "解说": "",
    "日文解说": "",
}

cft_detail = {
    "画师": "",
    "Cost": "",
    "初始/满级HP": "",
    "初始/满级ATK": "",
    "持有技能": "",
    "解说": "",
    "日文解说": ""
}
