from hoshino import HoshinoBot  # noqa

from ..path_and_json import *  # noqa

base_svt_detail = {
    "画师": {},
    "声优": "",
    "职阶": "",
    "性别（用于战斗和任务时的数据）": "",
    "身高": "",
    "体重": "",
    "属性": "",
    "隐藏属性": "",
    "筋力": "",
    "耐久": "",
    "敏捷": "",
    "魔力": "",
    "幸运": "",
    "宝具(资料面板中列出的参数)": "",
    "能力": [
        "基础",
        "满级",
        "90级",
        "100级",
        "120级"
    ],
    "ATK": [
        "",
        "",
        "",
        "",
        ""
    ],
    "职阶补正后": [
        "",
        "",
        "",
        "",
        ""
    ],
    "HP": [
        "",
        "",
        "",
        "",
        ""
    ],
    "Hit信息（括号内为每hit伤害百分比）": "",
    "Quick": "",
    "Arts": "",
    "Buster": "",
    "Extra": "",
    "宝具": "",
    "NP获得率": {
        "Quick": "",
        "Arts": "",
        "Buster": "",
        "Extra": "",
        "宝具": ""
    },
    "受击": "",
    "出星率": "",
    "被即死率": "",
    "暴击星分配权重": "",
    "特性": "",
    "人型": "",
    "被EA特攻": "",
    "猪化状态": ""
}

sp_svt_detail = {
    "画师": {},
    "声优": "",
    "职阶": "",
    "性别": "",
    "身高": "",
    "体重": "",
    "属性": "",
    "隐藏属性": "",
    "筋力": "",
    "耐久": "",
    "敏捷": "",
    "魔力": "",
    "幸运": "",
    "宝具": "",
    "特性": "",
    "人型": ""
}

cmd_detail = {
    "画师": "",
    "持有技能": "",
    "解说": "",
    "日文解说": "",
}

cft_detail = {
    "画师": "",
    "Cost": "",
    "初始/满级HP": "",
    "初始/满级ATK": "",
    "持有技能": "",
    "解说": "",
    "日文解说": ""
}

lib_svt_151_skill = {
    "特殊技能(人王盖提亚)": {
        "中文": "Ars Almadel Salomonis主啊，生命的喜悦Ars Almadel Salomonis主啊，生命的喜悦",
        "原文": "对敌方全体发动强大的攻击",
        "充能时间": "アルス・アルマデル・サロモニス主よ、生命の歓びを",
        "图标": "/images/9/95/Arts.png",
        "效果1": [
            "付与最大HP减少的状态(3回合)",
            [
                "400%"
            ]
        ]
    },
    "技能(魔神王盖提亚)": {
        "中文": "唤起",
        "原文": "喚起",
        "充能时间": "充能时间：8",
        "图标": "/images/1/13/%E6%9C%AA%E7%9F%A5%E6%8A%80%E8%83%BD.png",
        "效果1": [
            "自身充能增加",
            [
                "1"
            ]
        ]
    },
    "技能1(人王盖提亚)": {
        "中文": "贤者智慧",
        "原文": "賢者の智慧",
        "充能时间": "充能时间：8",
        "图标": "/images/1/13/%E6%9C%AA%E7%9F%A5%E6%8A%80%E8%83%BD.png",
        "效果1": [
            "自身防御力提升(3回合)",
            [
                "10%"
            ]
        ],
        "效果2": [
            "被伤害减免状态(3回合)",
            [
                "100"
            ]
        ],
        "效果3": [
            "弱化耐性提升(3回合)",
            [
                "10%"
            ]
        ],
        "效果4": [
            "充能增加",
            [
                "1"
            ]
        ]
    },
    "技能2(人王盖提亚)": {
        "中文": "愚者智慧",
        "原文": "愚者の智慧",
        "充能时间": "充能时间：8",
        "图标": "/images/1/13/%E6%9C%AA%E7%9F%A5%E6%8A%80%E8%83%BD.png",
        "效果1": [
            "自身攻击力提升(3回合)",
            [
                "10%"
            ]
        ],
        "效果2": [
            "暴击威力提升(3回合)",
            [
                "10%"
            ]
        ],
        "效果3": [
            "宝具威力提升(3回合)",
            [
                "10%"
            ]
        ],
        "效果4": [
            "付与无敌贯通状态(1回合)",
            [
                "∅"
            ]
        ]
    }
}
